In [181]:
import pandas as pd

In [182]:
df1 = pd.read_csv('customers.csv')
df2 = pd.read_csv('orders.csv')
df3 = pd.read_csv('products.csv')
df4 = pd.read_csv('ratings.csv')

In [183]:
df1.describe()

       customer_id
count   100.000000
mean     50.500000
std      29.011492
min       1.000000
25%      25.750000
50%      50.500000
75%      75.250000
max     100.000000

In [184]:
df2.describe()

          order_id  customer_id   product_id     quantity
count  1000.000000  1000.000000  1000.000000  1000.000000
mean    500.500000    48.708000    25.556000     2.413000
std     288.819436    28.923646    14.766683     1.115202
min       1.000000     1.000000     1.000000     1.000000
25%     250.750000    24.750000    12.000000     1.000000
50%     500.500000    48.000000    26.000000     2.000000
75%     750.250000    72.000000    38.000000     3.000000
max    1000.000000   100.000000    50.000000     4.000000

In [185]:
df3.describe()

       product_id      price
count    50.00000   50.00000
mean     25.50000  557.84000
std      14.57738  279.22724
min       1.00000   19.00000
25%      13.25000  335.25000
50%      25.50000  610.00000
75%      37.75000  771.00000
max      50.00000  994.00000

In [186]:
df4.describe()

       customer_id  product_id      rating
count   400.000000  400.000000  400.000000
mean     50.750000   24.987500    3.057500
std      29.079659   14.571313    1.379838
min       1.000000    1.000000    1.000000
25%      25.000000   12.000000    2.000000
50%      50.000000   26.000000    3.000000
75%      76.000000   38.000000    4.000000
max     100.000000   50.000000    5.000000

In [187]:
merged_df = pd.merge(df1, df2, on='customer_id')
merged_df = pd.merge(merged_df, df3, on='product_id')
merged_df = pd.merge(merged_df, df4, on=['customer_id', 'product_id'], how='left')
merged_df

,customer_id,name,order_id,product_id,order_date,quantity,product_name,price,category,rating
0,1,Customer_1,13,33,2023-07-31 08:39:23.971834,1,Lerhamn Chair,125,Chairs,NaN
1,1,Customer_1,14,20,2023-08-02 08:39:23.971834,1,Pjatteryd Picture,715,Decor,NaN
2,1,Customer_1,34,5,2023-09-05 08:39:23.971834,4,Hemnes Daybed,845,Beds,NaN
3,1,Customer_1,67,44,2023-08-03 08:39:23.971834,1,Koppang Dresser,765,Decor,NaN
4,1,Customer_1,79,32,2023-09-07 08:39:23.971834,2,Kivik Chaise,926,Sofas & Armchairs,NaN
...,...,...,...,...,...,...,...,...,...,...
997,100,Customer_100,532,25,2023-09-06 08:39:23.971834,1,Rens Sheepskin Rug,610,Decor,NaN
998,100,Customer_100,553,8,2023-07-30 08:39:23.971834,1,Melltorp Dining Table,369,Tables & Desks,NaN
999,100,Customer_100,674,46,2023-08-12 08:39:23.971834,4,Valje Wall Cabinet,669,Storage Solutions,NaN
1000,100,Customer_100,714,6,2023-08-27 08:39:23.971834,2,Brimnes Bed Storage,773,Beds,NaN
1001,100,Customer_100,766,31,2023-08-29 08:39:23.971834,2,Nockeby Sofa,787,Sofas & Armchairs,3.0

In [188]:
merged_df['rating'] = merged_df['rating'].fillna(0)

In [189]:
merged_df = merged_df.astype({
    'customer_id': int,
    'name': 'string',
    'order_id': int,
    'product_id': int,
    'order_date': 'datetime64[ns]',
    'quantity': int,
    'product_name': 'string',
    'price': float,
    'category': 'string',
    'rating': int
})

In [190]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1002 entries, 0 to 1001
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   1002 non-null   int64
 1   name          1002 non-null   string
 2   order_id      1002 non-null   int64
 3   product_id    1002 non-null   int64
 4   order_date    1002 non-null   datetime64[ns]
 5   quantity      1002 non-null   int64
 6   product_name  1002 non-null   string
 7   price         1002 non-null   float64
 8   category      1002 non-null   string
 9   rating        1002 non-null   int64
dtypes: datetime64[ns](1), float64(1), int64(5), string(3)
memory usage: 78.4 KB

In [191]:
category_codes, unique_categories = pd.factorize(merged_df['category'])
merged_df['category_id'] = category_codes

In [193]:
merged_df['Total_sales'] = merged_df['quantity'] * merged_df['price']
merged_df

,customer_id,name,order_id,product_id,order_date,quantity,product_name,price,category,rating,category_id,Total_sales
0,1,Customer_1,13,33,2023-07-31 08:39:23.971834,1,Lerhamn Chair,125.0,Chairs,0,0,125.0
1,1,Customer_1,14,20,2023-08-02 08:39:23.971834,1,Pjatteryd Picture,715.0,Decor,0,1,715.0
2,1,Customer_1,34,5,2023-09-05 08:39:23.971834,4,Hemnes Daybed,845.0,Beds,0,2,3380.0
3,1,Customer_1,67,44,2023-08-03 08:39:23.971834,1,Koppang Dresser,765.0,Decor,0,1,765.0
4,1,Customer_1,79,32,2023-09-07 08:39:23.971834,2,Kivik Chaise,926.0,Sofas & Armchairs,0,3,1852.0
...,...,...,...,...,...,...,...,...,...,...,...,...
997,100,Customer_100,532,25,2023-09-06 08:39:23.971834,1,Rens Sheepskin Rug,610.0,Decor,0,1,610.0
998,100,Customer_100,553,8,2023-07-30 08:39:23.971834,1,Melltorp Dining Table,369.0,Tables & Desks,0,4,369.0
999,100,Customer_100,674,46,2023-08-12 08:39:23.971834,4,Valje Wall Cabinet,669.0,Storage Solutions,0,5,2676.0
1000,100,Customer_100,714,6,2023-08-27 08:39:23.971834,2,Brimnes Bed Storage,773.0,Beds,0,2,1546.0
1001,100,Customer_100,766,31,2023-08-29 08:39:23.971834,2,Nockeby Sofa,787.0,Sofas & Armchairs,3,3,1574.0